
const mentalSupportTitles = [
    'Валидизация чувств', 'Эмоциональная поддержка', 'Поделиться опытом', 'Информационная помощь'
]
const mentalSupportDiscriptions = [
    'Другие участники могут просто выразить вам поддержку, сочувствие, подтвердить, что они понимают вас и что эмоции и реакции, которые у вас возникают в этой ситуации совершенно нормальны.',
    'В тяжелом эмоциональном состоянии мы склонны фокусировать свое внимание на проблемах и негативе, в то время как позитивные аспекты ситуации часто не замечаются. Вы можете попросить других участников, чтобы они помогли вам обратить внимание на собственные сильные стороны, позитивные качества, ресурсы, обстоятельства, подкрепляющие надежду, оптимизм и веру в себя.',
    'Вы можете попросить других участников группы, чтобы они поделились своим опытом, каким образом они справлялись в подобных ситуациях.',
    'Вы можете попросить поделиться определенной информацией, например, где можно найти квалифицированного специалиста.'
]

export const mentalSupportDiscription = () => {
    const mentalSupportDiscription = [];
    for (let i = 0; i < mentalSupportTitles.length; i++) {
        mentalSupportDiscription.push({
            title: mentalSupportTitles[i],
            discription: mentalSupportDiscriptions[i]
        })
    }
    return mentalSupportDiscription;
}

export const linkStyle = {
    underline: "none", target: "_blank", rel: "noopener noreferrer", cursor: "pointer"
};
